Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 四面八方数道身影已经冲来，凌冽的杀机锁定了他，江逸却面不改色，眸子死死盯着马飞，嘴角都是残笑，他大笑说道：“一百两紫金小爷没有，只有贱命一条。不过要想拿走小爷的命，就拿……你们公子的命换吧！”
en_us: Multiple enemies were charging towards him from all directions, locking in on him with chilling intent to kill. Yet, Jiang Yi's face betrayed nothing. His gaze never wavered away from Ma Fei and the corners of his mouth were lifted up in the remnants of a smile. Laughing loudly, he said, "This young master does not have a hundred taels of purple gold, he has nothing except for this humble life. However, if you want it, you can... exchange for it with your Young Master's life!"

source: 回到大殿内盘坐下来，江逸很快又暗暗兴奋起来，卖身五年至少短时间他的危机解除了，十天之后在这预支十两紫金，去风月楼赎回令牌就万事大吉了。至于江如龙？江逸已经不放在心上了，此刻有武殿提供丹药，他有强大信心，在短时间内将境界不断提升，只要达到铸鼎境四重，江如龙不足为惧。
en_us: Returning to the Great Hall, Jiang Yi had very quickly felt silently excited in his heart as he sat down cross-legged. The five-year sale of his person has at least relieved him of his crisis in the short term. With the advance of ten taels of purple gold coming after ten days, which he could bring to the Fengyue Brothel and redeem his command token, all will be well at long last. As for Jiang Rulong? Jiang Yi no longer took him to heart. With the Martial Arts Hall presently providing him with elixirs, he had great confidence; furthermore, with his power-level stages of the Cast Tripod Realm continuously increasingly in the immediate short term, so long as his power level reached the fourth stage of the Cast Tripod Realm, he would have no need to fear Jiang Rulong.

source: 回到房间后，江逸直接闭关了，他现在迫切需要变得强大，变强之心从所未有的强烈。他明白一个道理，要想主宰自己的人生，要想随心所欲的过自己的生活，那就必须成为强者。
en_us: Jiang Yi immediately went into seclusion after he went back to his room. It was of pressing importance for him to become stronger, as the urge of getting stronger reached an unprecedented "all-time high". It was a clear theory to him that he needed to be strong in order to be the Master of his own life and live the life that he wants to.

source: 回到江家南院炼丹房内，江逸还感觉在做梦般，他一下偷偷取出怀中的紫色金叶子看上几眼，细细摸几把，一下又藏进怀中，整个人都沉寂在喜悦当中。
en_us: Jiang Yi returned to the alchemy lab in the Jiang Residence Southern Court, still feeling as though he was dreaming. He secretly retrieved the purple gold leaf kept in his robes to look at it and gently touch it several times, before storing it back in his robes again. He was completely lost in euphoria.

source: 回到江家西院，已经是黄昏时分了。此刻西院很是热闹，这里住着的是江家的家将和仆人，天黑都各自回家了。一路上两人遇到很多家将仆人，不过没有人理会她们，最多只是看上两眼，甚至还有人露出嘲弄的笑意……
en_us: By the time they returned to the western court of the Jiang Residence, it was already evening. The western courtyard was crowded and full of noise, as the Jiang Clan servants who lived there were just returning home as the sky turned dark. However, no one bothered them—at most taking a quick glance or so, some even giving a look of mockery and laughter...

source: 回去……要走哪边？
en_us: Which direction is... home?

source: 回复了荣管事之后，江逸回到了自家小院，让江小奴去找春芽打探消息。半个时辰之后江小奴就回来了，得到了江如虎等人的消息。
en_us: After returning to report to Chief Rong, Jiang Yi returned to the small courtyard of his own home and sent Jiang Xiaonu out to find Chunya and gather some news. An hour later, Jiang Xiaonu returned home, having gathered information about Jiang Ruhu and his gang of cronies.

source: 回头一想万妖会那天的情况，顿时又淡定了。
en_us: But after recalling the situation at the day of the demon gathering, it regained its composure again.

source: 回头一看，原本的密林已经塌了个彻底，岛上三分之二的地界凌空升了起来。地面出现了四根粗大的柱子，随着又一声雷鸣般的吼声，一个巨大的黑色脑袋从那三分之二的浮岛里伸了出来，张口露出满嘴的尖牙。而原本的地界开始刷啦啦的出现了一排巨大的尖刺，遍布其上。
en_us: Turning back, the two of them saw the entire dense forest collapse. Two-thirds of the land was in the air. Four huge pillars appeared under the floating island. They heard another roar and saw a great, black head stretch out of the floating island. It opened its mouth to reveal a row of sharp teeth. A row of spikes grew out of what had originally been the ground.

source: 回头一看，那剑阵中已经没有人了，“幻阵！”
en_us: Turning back to look, he saw there was no one in the sword array anymore. "Illusion array!"

source: 回头瞅了瞅她身后，果然看到了另外两个修士，羿清贵人它见过，只是没想到不过短短的时日，对方已经是化神修士了。而且另外一件居然也是个化神，心下对沈萤越加的恭敬起来。
en_us: The Rabbit Monarch looked behind Shen Ying and, as expected, saw two other cultivators. One was Benefactor Yi Qing whom it was acquainted with, though it had not expected Yi Qing to already have become a Soul Formation cultivator in such a short period of time. Incredibly enough, the other one was a Soul Formation cultivator as well. The Rabbit Monarch felt more respect than ever for Shen Ying.

source: 回头瞅了瞅还一脸茫然的沈萤，嘴角顿时一抽，突然不想收徒是肿么回事？
en_us: Turning around, Lonemoon took a glance at Shen Ying who was still wearing a blank look on her face. All at once his mouth twitched. Why did he suddenly feel that he did not want a disciple after all?

source: 回头瞅了瞅，仍旧懒洋洋一脸废柴样弱鸡似的沈萤，那个疑问再次冒出来，“喂沈萤，说认真的……你身上那恐怖的能力到底哪来的？”那一剑简直……简直就像开天劈地一般。
en_us: Turning back, Lonemoon saw that she still looked about as alive as a half-dead chicken. The question in his mind surfaced again. "Hey Shen Ying, seriously… where does that terrifying ability of yours come from?" That blow from her sword… almost hacked heaven and earth apart.

source: 回应江逸的话是四名爆射而来的身影，还有几个破空而来的拳头。
en_us: What he got in response was the shadows of the four guards that darted towards him. A few fists came tearing through the air as well.

source: 回来的路上，江逸检查了小奴的伤势并不算太严重，此刻也就不去管她了，望着摇曳的烛火，心里犯愁起来……
en_us: On the route home, Jiang Yi observed that Xiaonu's injuries were not that serious. As such, he chose not to be too concerned for her, instead staring at the flickering candlelight flame. It was then that he became increasingly anxious and worried...

source: 回答两人的是一道清脆的骨头碎裂声，还有江松惨绝伦寰的尖叫。江逸似乎没有听到两人的喝声，砸断江松一条腿后，大腿高高抬起对着江松的另外一条腿狠狠跺了几脚，将他另外一条腿废掉，才面无表情的转头过来望着江顾水说道：“江家有一条隐藏的族规，叫祸不及家人是吧？江如虎他们和我有仇，要打要杀我认！但为何要欺负我那没有半点武力的小侍女？今日别说你们，就算天王老子来了，我也要废了这三人。”
en_us: The reply to both their statements was the crisp and clear sound of bone cracking, followed by the miserable scream from Jiang Song. Seemingly deaf to the shouts from Jiang Gushui and Jiang Rulang, Jiang Yi raised his leg again, this time targeting Jiang Song's other leg. After trampling on Jiang Song's other leg and crippling it too, Jiang Yi then turned around and spoke to Jiang Gushui indifferently, "The Jiang Family has an unspoken rule. That is to not get the other family members involved in one's own conflicts right? If Jiang Ruhu and his group has any vengeance against me. I will make no complains if they come for me! But why do they need to bring this onto my servant girl who doesn't know an ounce of martial arts? Today, don't even mention the two of you, even if God is here, I will still cripple the three of them."

source: 回答众人的是——江如虎的身子又被高高抡起，然后重重朝地面砸下，江逸嘴角都是残笑，似乎豁出去，冷然道：“退不退？”
en_us: What responded the group's threats was -- the scene of Jiang Ruhu's body being once again swung a high distance upwards, before subsequently being smashed downwards into the ground. A cruel smile formed on the corner of Jiang Yi's mouth, as though he were pressing his luck. He shouted coldly, "Are you going to retreat or not?"

source: 回院后，孤月里里外外把九人挨个夸了一遍，特别是四个晋级的人。再顺便安抚了一下她们即将决赛的紧张心情。
en_us: When they returned to the yard, Lonemoon took the time to praise each one of his nine new disciples, especially the four Foundation Establishment disciples, and he also calmed their post-competition nerves.

source: 因为上青界要交待，所以为了宗门，他们决定把羿清推出去！因为一个人牺牲，总比起灭门要强？
en_us: The Upper Azure World had given the command. To save their sect, they wanted to give Yi Qing up! Was it really better to sacrifice one person than to see the entire sect be destroyed?

source: 因为他的丹田被封印了，他修炼的速度一直慢如蜗牛。虽然他有黑色元力使用丹药辅助修炼，能在短时间内让修炼提速，但越修炼到后面境界需要的元力越来越多，除非天天没事把圣品丹药当糖嗑，否则江逸这辈子注定成就有限！
en_us: As his dantian was sealed, his refinement speed had always been as slow as a snail. He had black essence force that could be used with elixirs to facilitate his refining practice, which could in turn speed up his refining. However, as the amount of essence force needed to refine higher realm levels increased, unless he ate saint-grade elixirs daily like candy, Jiang Yi would forever be limited in what he could do!

source: 因为思羽那一战，让整个上青界都知道，无敌派上下全是体修。本来就没有几个人喜欢修体，这一波宣传下，算是彻底的堵死了，别人想拜入无敌派的想法。毕竟有更轻松的练修方法，谁也不会想不开，去做动不动就会被劫雷劈死的体修啊。
en_us: The reason was because with Si Yu's battle, the entire Upper Azure World knew that all of Invincible Sect's disciples were Body Cultivators. There weren't many who liked Body Cultivators for starters, and now with this kind of promotion, their road to success was completely blocked. There was no need to have hope that anyone would want to join the Invincible Sect; after all, there were easier paths of cultivation. Nobody would want to do things the hard way and get struck dead in the process of body cultivation.

source: 因为这一刻，他骤然发现自己的脑海里竟多了几十个黑色的小篆字符！？
en_us: At that moment, he found his mind suddenly filled with countless tiny black symbols and words.

source: 在他丢进三枚丹药，注入一缕黑色元力时，丹炉内再一次传来一阵沉闷的爆炸声，而在他将炉盖揭开的时候，却发现里面的三枚丹药又全炸了……
en_us: When he threw in three elixir pills and injected a wisp of black essence force, a deep explosive sound rang out from within the cauldron. When he lifted the cauldron lid and revealed its contents, he discovered the three elixir pills in the cauldron had once again completely exploded...

source: 在他刚想询问几句陪练的规矩，后面走廊内传来一道脚步声，那管事立即撇下他笑着迎了上去。
en_us: Just as he thought of inquring a few queries regarding the rules of sparring partnerships, the sound of footsteps rang from the corridor behind him. That manager immediately cast him away by sending him off with a smile.

source: 在他花费了大半个时辰提炼出两缕黑色元力，准备去增幅药力时，却发现笼罩在丹田外的绿色药力已经消耗干净了。
en_us: after he spent two whole hours refining two strands of black essence force and was prepared to increase the medical power, he realized the green medicinal power wrapped around the exterior of his dantian had already been fully consumed.

source: 在南与北两个方向间，来来回回了十几趟后，那人拽出了深藏于地下几百米处的，刚刚成魔的小梦魔，问到了需要的信息。终于朝着大陆中部的魔王殿进发了。
en_us: After going back and forth between the North and the South for many rounds, that person dragged out the recently demonized Dream Fiend hiding hundreds of meters beneath the ground. The person got all the necessary information from the Dream Fiend, and headed towards the Demon King Palace, located in the center of mainland.

source: 在场的人每人都欺负过人，都打过家族的低级子弟，他们打人的时候也很凶残，但此刻却都被江逸的手段吓到了，脑海内浮现的唯一念头就是，以后千万不能招惹此人……
en_us: Everyone here had once bullied someone, or beaten the lower classed clansmen. They were also extremely ruthless when they were beating people up, but right now they were all shocked by the measures of Jiang Yi. There was only one thought in their minds, that was to never incite the wrath of this man in the future...

source: 在场的六人，顿时脸色一变。
en_us: The six other men's expressions changed.

source: 在天星大陆，人人都能借助金木水火土等等最基本的天地元气来提炼元力，因为只有体内拥有浑厚的元力，才能施展出各种威力强大的武学神通，开山裂石，飞天遁地都不在话下。但要是没有元力，哪怕武技神通比划得再精妙，哪怕掌握了几万种武技的口诀，你也施展不出来，只能做个废物！
en_us: The inhabitants of the Stellarsky continent regularly borrowed the powers of the basic elements—metal, wood, water, fire, and earth—to cultivate and expand their essence force, as only those with a great amount of essence force could put various techniques of great might to use. Even splitting entire mountains, flying freely in the sky, and becoming virtually invincible was possible with enough essence force. However, without any essence force, no matter how skilled one was in martial arts and regardless of how many techniques one had mastered, it would all be rendered useless. Without essence force, one couldn’t execute even the most basic martial art!

source: 在天羽城内，姬家就是土皇帝，没有家族敢招惹姬家。姬家子弟倒是也很自律，很少欺压各家族子弟。其余家族则不同了，为了各家族的利益经常明争暗斗，数百年下来四大家族积怨颇深，家族子弟在天羽城内斗殴那更是家常便饭。
en_us: Within Skyplume City, the Ji Family was akin to a royal family. No other family clan dared to provoke the Ji Family. For their part, Ji Family descendants were themselves very disciplined and rarely bullied or oppressed the descendants of other family clans. The other remaining family clans acted differently. The clans regularly fought with each other openly and maneuvered against one another covertly to attain advantages in their own interest. The four great families had deep grudges for each other, developed over centuries of conflict, and fights between descendants of each family clan were truly commonplace and not out of the ordinary.

source: 在昨夜突破了铸鼎境二重之后，江逸心里不仅不再畏惧江如虎，反而大摇大摆的上山，希望江如虎会来堵他，他好狠狠出一口恶气。
en_us: After making a breakthrough and reaching the second stage of the Cast Tripod Realm the night before, not only did Jiang Yi not have any fear nor dread for Jiang Ruhu in his heart; he instead swaggered up the mountain, hoping that Jiang Ruhu would stop him. He hoped to take the opportunity to ruthlessly get his revenge.

source: 在杨管事请示了费老后，武殿做了一个决定，将江逸命名为最顶级的紫金陪练，同时通告整个武殿，苍狼陪练每天只陪练三场，每一场陪练需要——百两紫金。
en_us: After Manager Yang asked Elder Fei for instructions, the Martial Arts Hall made a decision to designate Jiang Yi as the highest-level purple gold token-grade sparring partner. At the same time, they announced throughout the entire Martial Arts Hall that the sparring partner "Lone Wolf" would only spar in three matches every single day, and each sparring match would require - one hundred taels of purple gold.

source: 在武殿内闭关第十三天，江逸照例和翊凌雪对战了半个时辰，这次翊凌雪却没有匆忙离去换衣裳，反而好奇的询问起来。
en_us: On the 13th day of seclusion at the Martial Arts Hall, Jiang Yi finished his customary sparring practice with Yi Lingxue. Afterwards however, instead of hurriedly leaving to change like she usually did, Yi Lingxue stayed behind and questioned Jiang Yi curiously.

source: 在江家，江逸小时候因为自身体质以及大长老的关系，尝试过不少心法，也见识过很多种颜色的元力。除了水系功法大多是蓝色，火系功法大多是红色外，比如木系功法多数绿色，土系功法多数黄色……但他从没见到过能练出黑色元力的功法！
en_us: In the Jiang Clan, due to his relationship with the Grand Elder as well as his personal physical condition, Jiang Yi had been trying many methods of spirit training and had similarly witnessed essence force of numerous colors. Water-element techniques usually produced blue essence force, and fire-element techniques usually produced red. There were also wood-element techniques, which produced green and earth-element techniques which produced yellow. Yet he had never observed a technique that could produce black-colored essence force!

source: 在江豹的两条腿被江逸活生生的踩断，他目光锁定江如虎后，江顾水两人终于忍不住了，身上元力疯狂运转，气势腾起，江顾水爆喝起来：“江逸，最后给你一次机会，现在罢手，等候刑堂处理，否则别怪我们两人不客气！”
en_us: Once Jiang Bao's legs were forcibly broken by Jiang Yi's trample, his sights were locked on Jiang Ruhu. Jiang Gushui and Jiang Rulang couldn't hold back any longer and began circulating their essence force. Putting on an imposing aura, Jiang Gushui roared, "Jiang Yi, this is your last chance. Stop right now and wait for the Disciplinary Court to serve your punishment. If not, do not blame us for being impolite!"

source: 在江逸离开之后，那满头灰白头发的柳长老却突然走出偏厅进了丹房内查看了一遍，出来后很是满意的点了点头呢喃一声，再次走进了偏厅研究他“意外炼制”出来的地阶丹药……
en_us: After Jiang Yi left, Elder Liu, the man with a head full of grayish white hair, suddenly walked out of the side room and entered the Elixir Room to check. When he left, he nodded his head with satisfaction and, muttering to himself, once again entered the side room to research on his "accidentally refined" Earth-tier elixir...

source: 在江逸踢出第六腿的时候，江松的右腿小腿终于传来一道骨头碎裂声，江松也跟着惨叫起来，再也无法支撑身体重心，一下摔倒在地，抱着右腿痛嚎起来。
en_us: On the sixth attack that Jiang Yi released, Jiang Song's right leg finally released the sounds of bones being broken. Jiang Song's agonized screams followed suit. No longer able to hold up his body weight, Jiang Yi's body crashed to the floor. He held his right leg and cried in bitter pain.

source: 在没有元力的情况，武者对战只能完全依靠战斗本能和反应速度，以及武技了。这样对练起来能大大的增强武者反应速度，和武技的熟练度。
en_us: In a circumstance where there was no available essence force to use, martial artists seeking combat could only rely completely on the combat instincts and response speed, as well as their skills in martial arts. In this way, during sparring training, a martial artist's reaction speed and level of proficiency could be greatly increased.

source: 在知道真相的那一刻，他的内心是激动的，此人仿佛是这污秽世间中，唯一的一股清泉。他也想像她一样，永远保持这份本心，更想像她一样强大。生平第一次有了拜师的想法，拜她为师，是他除了修行以外，首次想要执着的事。只是担心她不愿而已。
en_us: His heart had been surging with emotions in the moment he realized the truth. Such a person was like a clear spring in this filthy world. He wanted to be just like her, to forever stay true to his heart, and even more so to become as strong as her.

source: 在确定江逸不能修炼后，收养他的大长老瞬间便苍老了十岁有多，他从此整日闭门不出，翻阅各种符箓古籍，四处寻访符文高手，希望有朝一日能够破解封印。
en_us: When he confirmed that the Jiang Yi could no longer cultivate essence force, the Grand Elder spent entire days indoors, reading all kinds of ancient texts and old talisman books in an attempt to find a solution to his god-grandson’s problem. He went to the edges of the world in order to seek the assistance of linguists and masters in talisman magic, all in the hopes of being able to break the seal one day. The poor Grand Elder... in mere months, he looked as if he had aged ten years!

source: 在管事房被荣管事骂了个狗血喷头，江逸快步走出西门上了西山清点药草，好在这次还是在西山药田做杂物，荣管事没有提及令牌的事情。而且上西山时，山下的家族护卫都认识他，倒是没有要他出示令牌。
en_us: After being viciously scolded by Chief Rong at the Housekeeping Chamber, Jiang Yi walked out of the Western Door in a quick pace and headed up the Western Hills to take stock of the medicinal plants there. Thankfully, this time he was once again tasked with doing odd jobs around the medicinal plantations of the Western Hills, and Chief Rong had not mentioned anything about the command token. Additionally, while he was heading up the Western Hills, as the clan guardsmen at the foot of the hills recognised him, they did not require him to reveal his command token.

source: 在这护卫看来，绝对的力量可以碾压一切武技，更别说江逸这实力根本不能发挥武技的威力，就如刚才江逸使出“摔碑手”一样被他轻松荡开般。
en_us: As that guard saw it, his absolute power could crush all martial arts techniques—let alone Jiang Yi's abilities which could not even manifest the innate power of any martial arts techniques. As an example, the Wrestling Hand technique that Jiang Yi used earlier was easily deflected by him.

source: 在这武殿内修炼速度果然快了两倍，达到铸鼎境二重黑色元力凝练了，增幅药力的时间也增长到大半柱香时间，感受到丹田内井水般喷出的蓝色元力，江逸整个人都兴奋的不得了。
en_us: The power cultivation speed in this Martial Arts Hall was indeed faster by two times. Having reached a power-level at the second stage of the Cast Tripod Realm and producing condensed black essence force, with the time that the elixir medical efficacy lasted also having extended up to more than two and half minutes of time, as well as sensing that blue essence forces were splurting out of his dantian like a well of water, Jiang Yi felt completely and uncontrollably excited.

source: 在那些巍峨的城墙宫壁上，在那些华丽的宫殿阁楼内，在天庭的地面、街角，突兀地浮现出谁也数不清的七彩符文。
en_us: The towering palace walls, the insides of the majestic palace lofts, and the surface and road corners of the Heavenly Court all lit up, and countless multi-colored runic patterns suddenly appeared.

source: 在院里的石椅上坐下，身体前倾，习惯性像摊烂泥一样趴在了石桌上。算了，既然不用帮忙，她也懒得动。阳光这么好，最适合……睡觉了。
en_us: She sat down on the stone bench in the yard and leaned forward, habitually lazing on the stone table like a slob. Forget it, she thought to herself; since help was not needed, she was also too lazy to budge. The sunshine was especially great for… sleeping.

source: 地上十四五岁的小丫头也惊醒过来，看到暴怒冲来的江逸，一张小脸完全吓坏了，拼命的大喊起来：“少爷你不是他的对手，别管我，快走！”
en_us: The fourteen-year-old girl on the ground snapped to her senses. When she saw the wrathful Jiang Yi rushing over, she was scared out her wits. "Young Master,” she screamed with all her might, “you are not his match! Ignore me! Leave quickly!"

source: 地上的几人齐齐一缩，点头如葱倒。
en_us: The people on the ground suddenly stood upright and nodded in response.

source: 地底！
en_us: Underground!

source: 地面一震，坚硬的青石板瞬间裂成两瓣，他的左拳深深的砸了进去，整个拳头都没入到石板下面的土里。
en_us: The ground shook. His left fist smashed right into the limestone slab and split it into two halves. His fist did not even hit the ground below the slab.

source: 场上的人一顿，秒停。
en_us: Everyone present were stunned and immediately froze.

source: 场上那场血腥的殴打，整整持续了十分钟，场外的裁判这才反应过来，连忙大声道，“无……无敌派，思羽胜！”
en_us: The bloody beating of a match lasted for ten minutes before the judge managed to react and shout, "Invincible… Invincible Sect, Si Yu wins!"

source: 场面一度十分尬尴。
en_us: This became a really awkward situation.

source: 场面一度十分尴尬……
en_us: It was an extremely awkward scene...

source: 坑里的人一僵，脸色顿时一白。
en_us: The man in the pit suddenly paused and turned pale.

source: 城池北方的虚空之上异常诡异地裂开了一道裂缝，一双数丈长的白骨大手无声无息地自裂缝中伸出并把住裂缝的两边，将裂缝进一步撕开。
en_us: out of the the void in the north of the city, a strange crack appeared. From the crack a pair of long, skeletal hands stretched out and pushed the crack wider.

source: 塔内。
en_us: Inside the pagoda.

source: 塔内漆黑一片，根本看不见第二个一同入塔的身影，与外面的仙气渺渺不同，里面到处都是阴气，而且时不时还会化为实体，攻击入塔之人。
en_us: It was pitch black inside. Yi iQing coul not see anyone else in the pagoda. Yin Qi, not Immortal Qi, filled the air inside. The Yin Qi periodically condensed into a material form and attacked the people in the pagoda.

source: 塔顶。
en_us: At the top of the pagoda.

source: 声音之大，甚至用上了灵气，连着殿宇都震了震。
en_us: Their voices were loud - some of them even made use of their Spirit Qi to shout. The walls of the hall seemed to vibrate.

source: 声音响起的那一刻，羿清明显听到全体兔妖齐齐舒了口气，一副劫后余生的样子。连着盖房的速度都加快了不少。
en_us: Once those sounds reached their ears, Yi Qing clearly heard the entire cohort of rabbit demons heaving sighs of relief appearing as if they had just survived a disaster. Even their speed of rebuilding the cottage increased quite a bit.

source: 声音那叫一个此起彼伏，连绵不断，跟循环广播似的。
en_us: The voices sounded out continuously, one after another. It sounded just like a soundtrack on repeat..

source: 处于视觉盲区的易峰，顿时一喜，虽然不知道这背云兽怎么绊倒的，但这是个机会！
en_us: Yi Feng, who could not see Shen Ying from where he was, celebrated. He was unsure of how the beast collapsed, but this was his chance!

source: 处处怪石矗立，熔岩遍地，天际都是一片灰蒙蒙。
en_us: Strange rocks aloft every area, lava lurking every inch of ground. Grey is the only color seen for as far as visible.

source: 外卖什么鬼？
en_us: What the heck was food delivery?

source: 外药，也就是上药和服药，内调则是通过运转体内元力，对伤处进行气血疏通和修补调节。所以江逸在上好药后，还要通过修炼江水诀，运转体内铸鼎境一重的元力，来帮助伤口更快复原。
en_us: In other words, one had to consume or apply any necessary medicine and direct the essence force in the body towards the wound. This would ensure the smooth circulation of blood and life force around the body to aid in regeneration. Thus, after applying medicine, Jiang Yi still had to practice the Jiang Water Art to circulate the essence force from the first stage of the Cast Tripod Realm and help his wounds heal faster.

source: 外面出来一阵沉重的脚步声，将众人的思绪拉了回来，江顾水等人很快醒悟过来。
en_us: A sounds of heavy footsteps could be heard from the outside which brought everyone by to their senses. Jiang Gushui and the others came to realization quickly.

source: 外面的两位龟公正在拉客没注意江逸，让他一下冲进了内堂，里面一位半老徐娘老鸨倒是看到有客上门，扭着蛇腰，媚笑迎了上来：“哟，这位小哥那么猴急干什么？我家的姑娘……”
en_us: The two pimps were busy hustling customers and did not notice Jiang Yi, allowing him to dash into the inner hall. Inside, a middle-aged mamasan gyrated her hips and greeted him with a smile. "Oh my! Young man, why are you so impatient? Our ladies…"

source: 夜色如浓稠的墨汁，深沉的化不开，一丝光都没有，四野寂静的令人可怕、心慌。
en_us: The night was as dark as thick black ink, without even a ray of light. The surroundings were eerily quiet and nerve wracking.

source: 夜黑风高，捉妖夜。
en_us: It was a dark and windy night. A night for catching a demon.

source: 够了！你两到底是来降妖的，还是来敲诈的啊喂！
en_us: Enough! Are both of you here to capture the demon, or to extort?!

source: 大仙的心思好难猜！
en_us: The Great Immortal's mind is a mystery!

source: 大仙的眼神突然好可怕？他说错什么了吗？
en_us: Why was the Great Immortal's gaze suddenly so terrifying? Did he say anything wrong?
